WELCOME_TEXT = "Добро пожаловать в телеграмм бота, для тестового задания в Яндекс практикум."

MY_HOBBY_TEXT = "Моим главным увлечением является 3D печать и 3D моделирование. Поистине, около 7 лет назад я " \
                "случайно наткнулся на видео о 3D печати, и это изменило мою жизнь навсегда. Меня захватило зрелище " \
                "того, как из простого прутка пластика возникают удивительные детали с сложной геометрией всего за " \
                "несколько часов. С того момента я просто не мог представить свою жизнь без 3D принтера.\n\nЧерез год " \
                "уговорил родителей подарить мне мой первый 3D принтер. И, буквально через несколько месяцев, " \
                "я стал первым в своем городе, кто начал осваивать это захватывающее искусство. Начало было " \
                "непростым, потому что в СНГ 3D печать только начала завоевывать популярность. Поэтому мне пришлось " \
                "изучать английский язык, чтобы понимать, как правильно настраивать мой принтер.\n\nСо временем я " \
                "стал способен без труда печатать сложные модели и даже начал создавать собственные проекты. В " \
                "девятом классе я использовал свой 3D принтер для создания стереометрических фигурок на уроках " \
                "геометрии, чтобы получать отличные оценки. Таким образом, я шаг за шагом осваивал искусство 3D " \
                "моделирования, учился создавать чертежи и углублял свои знания в работе с различными " \
                "материалами.\n\nНа первом курсе института я полностью переделал свой старый принтер. Фактически, " \
                "старого в нем уже не осталось. Это похоже на парадокс Тесея! В настоящее время у меня уже три 3D " \
                "принтера, каждый из которых предназначен для разных целей, и они постоянно находятся в работе, " \
                "помогая мне зарабатывать средства.\n\nИ все же, несмотря на то, сколько лет я уделяю 3D печати, " \
                "каждый раз, когда я наблюдаю, как работает принтер, я возвращаюсь к тому волшебному моменту, " \
                "который произошел 7 лет назад. "

HELP_TEXT = "Этот бот сделан в качестве тестового задания для Яндекс практикума.\n" \
            "В боте реализованно 5 основных команд:\n" \
            "/start - Начало работы с ботом\n" \
            "/help - Помощь\n" \
            "/link - Ссылка на репозиторий с исходным кодом\n" \
            "/gpt - Объяснение, что такое GPT для бабушки\n" \
            "/sql - Разница между SQL и NoSQL в двух словах"
